/*
1、C# 中预定义类型
----------------------------------------------------------------------------------------
类型              名称          CTS类型           说明              类型后缀            位数
----------------------------------------------------------------------------------------
整型              sbyte       System.SByte      8位有符号
                 short       System.Int16      16位有符号
                  int         System.Int32      32位有符号
                 long        System.Int64      64位有符号             L

                  byte       System.Byte        8位无符号
                 ushort       System.UInt16      16位无符号
                  uint         System.UInt32      32位无符号          U
                 ulong        System.UInt64      64位无符号           UL

---------------------------------------------------------------------------------------
浮点型             float       System.Single       32位单精度浮点数       F              7
                  double      System.Double       64位单精度浮点数                    15/16   

----------------------------------------------------------------------------------------
Decimal类型       decimal     System.Decimal      高精度浮点数          M               28

    decimal类型表示精度更高的浮点数，小数点的位数可由用户自定义，但decimal不是基本类型，计算时可能会有性能损失。

----------------------------------------------------------------------------------------
Bool类型          bool        System.Boolean
                值只能为true/false，C#中 bool类型不能与整数类型相互转换。
----------------------------------------------------------------------------------------
字符类型           char        System.Char     16位的字符(Unicode编码)
----------------------------------------------------------------------------------------
引用类型          object                      根类型，CTS中其它类型是从它派生出来的，包括值类型
                 string      System.String    Unicode字符串
    string可以包含unicode、16进制数的转义序列，在字符串前加@，即不会降 \ 解释位转义标识。
----------------------------------------------------------------------------------------
 */

/*

2、变量的初始化及作用域

C# 中变量使用前，必须初始化，否则报错。

C# 使用 new 实例化一个引用对象，引用之后，对象就会把引用指向存储在堆上的一个对象。

变量的作用域是可以访问变量的代码区域。
    A 只要类在某个作用域内，其成员也在该作用域内。
    B 局部变量存在于声明变量所在的语句开始之后，到封闭花括号之前。
    C 在For While 或类似语句中声明的局部变量存在于循环体内。


 
 */


using System;

namespace term01
{
    class DataClass
    {
        public static void useDataClass()
        {
            // 1、声明初始化变量

            int i;
            i = 10;

            int j = 20;

            int x = 10, y = 20;


            //Console.Write(i, j, x, y);
            Console.WriteLine("i={0}, j={0}, x={0}, y={0}", i, j, x, y);

            // 2、声明初始化对象
            object a = new object();


        }
    }
}
